Shell> pci
pci: Protocol - PciRootBridgeIo not found.
Shell> drivers
            T   D
D           Y C I
R           P F A
V  VERSION  E G G #D #C DRIVER NAME                         IMAGE NAME
== ======== = = = == == =================================== ==========
 D FFFFFFFF ? - -  -  - <null string>                       
Shell> devices
     T   D
     Y C I
     P F A
CTRL E G G #P #D #C  Device Name
==== = = = == == === =========================================================
Shell> devtree
 Ctrl[01] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)
 Ctrl[04] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(0)/eMMC(0)
 Ctrl[05] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(0)/eMMC(0)/HD(1,GPT,9a37767d-7eb2-488e-8db1-43d3a46e1d53,0x800,0x12c000)
 Ctrl[06] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(0)/eMMC(0)/HD(2,GPT,59317e6a-e3a7-4b0b-b4d6-1468f1f7a4bb,0x12c800,0x200000)
 Ctrl[07] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(0)/eMMC(0)/HD(3,GPT,397e5c08-d475-429b-8d57-504e9de3eca2,0x32c800,0x1a777df)
 Ctrl[08] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(1)
 Ctrl[09] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(1)/HD(1,GPT,714a638b-a384-4a61-a45e-40c7691c554a,0x4000,0x3c000)
 Ctrl[0A] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/UsbClass(0x0,0x0,0x9,0x0,0x3)/UsbClass(0x451,0x8140,0x9,0x0,0x3)/UsbClass(0x8564,0x1000,0x0,0x0,0x0)
 Ctrl[0B] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/UsbClass(0x0,0x0,0x9,0x0,0x3)/UsbClass(0x451,0x8140,0x9,0x0,0x3)/UsbClass(0x8564,0x1000,0x0,0x0,0x0)/HD(1,GPT,85b731b6-a4b2-47f4-b1c6-aef6e0f2ce81,0x800,0xfffff)
 Ctrl[0C] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/UsbClass(0x0,0x0,0x9,0x0,0x3)/UsbClass(0x451,0x8140,0x9,0x0,0x3)/UsbClass(0x8564,0x1000,0x0,0x0,0x0)/HD(2,GPT,ac600dc7-3160-4f3c-a824-496d00e3d007,0x100800,0x18fff)
 Ctrl[0F] /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/MAC(00e04b6fdccd,1)
Shell> dmpstore
Variable NV+RT+BS 'EFIGlobalVariable:OsIndications' DataSize = 0x08
  00000000: 00 00 00 00 00 00 00 00-                         *........*
Variable RT+BS 'EFIGlobalVariable:OsIndicationsSupported' DataSize = 0x08
  00000000: 1C 00 00 00 00 00 00 00-                         *........*
Variable RT+BS 'EFIGlobalVariable:PlatformLangCodes' DataSize = 0x06
  00000000: 65 6E 2D 55 53 00                                *en-US.*
Variable RT+BS 'EFIGlobalVariable:VendorKeys' DataSize = 0x01
  00000000: 00                                               *.*
Variable RT+BS 'EFIGlobalVariable:DeployedMode' DataSize = 0x01
  00000000: 00                                               *.*
Variable RT+BS 'EFIGlobalVariable:AuditMode' DataSize = 0x01
  00000000: 00                                               *.*
Variable RT+BS 'EFIGlobalVariable:SetupMode' DataSize = 0x01
  00000000: 01                                               *.*
Variable RT+BS 'EFIGlobalVariable:SecureBoot' DataSize = 0x01
  00000000: 00                                               *.*
Variable NV+RT+BS 'EFIGlobalVariable:BootOrder' DataSize = 0x02
  00000000: 00 00                                            *..*
Variable NV+RT+BS 'EFIGlobalVariable:Boot0000' DataSize = 0x78
  00000000: 01 00 00 00 64 00 46 00-65 00 64 00 6F 00 72 00  *....d.F.e.d.o.r.*
  00000010: 61 00 00 00 04 01 2A 00-01 00 00 00 00 08 00 00  *a.....*.........*
  00000020: 00 00 00 00 00 C0 12 00-00 00 00 00 7D 76 37 9A  *............}v7.*
  00000030: B2 7E 8E 48 8D B1 43 D3-A4 6E 1D 53 02 02 04 04  *.~.H..C..n.S....*
  00000040: 36 00 5C 00 45 00 46 00-49 00 5C 00 66 00 65 00  *6.\.E.F.I.\.f.e.*
  00000050: 64 00 6F 00 72 00 61 00-5C 00 73 00 68 00 69 00  *d.o.r.a.\.s.h.i.*
  00000060: 6D 00 61 00 61 00 36 00-34 00 2E 00 65 00 66 00  *m.a.a.6.4...e.f.*
  00000070: 69 00 00 00 7F FF 04 00-                         *i.......*
Variable NV+RT+BS 'EFIGlobalVariable:PlatformLang' DataSize = 0x06
  00000000: 65 6E 2D 55 53 00                                *en-US.*
Shell> dh -d -v
Handle dump
01: DevicePath(7ED7E510)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b) DevicePathToText(7FFB8628) DevicePathUtilities(7FFB8638) E617D64C-FE08-46DA-F4DC-BBD5870C7300(7FFD5670) UnicodeCollation2(7FFB8B98) HIIString(7FFB89B0) HIIDatabase(7FFB8958) 
02: SimpleTextOut(7FFD55D8)   Address: 7FFD55D8 Attrib 07
     mode 0: Col 80 Row 25
     mode 1: Col -1 Row -1
  *  mode 2: Col 127 Row 39 
03: SimpleTextIn(7FFD5578) SimpleTextInEx(7FFD5590) 
04: DevicePath(7DD3B040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(0)/eMMC(0) BlockIO(7ED7ECC8)   Removable MId:1 bsize 200, lblock 1DA3FFF (15,913,189,376), raw rw !cached 
05: DevicePath(7DD38040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(0)/eMMC(0)/HD(1,GPT,9a37767d-7eb2-488e-8db1-43d3a46e1d53,0x800,0x12c000) BlockIO(7ED7F068)   Removable MId:1 bsize 200, lblock 12BFFF (629,145,600), partition rw !cached EFISystemPartition(0) SimpleFileSystem(7ED7F420) 
06: DevicePath(7DD36040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(0)/eMMC(0)/HD(2,GPT,59317e6a-e3a7-4b0b-b4d6-1468f1f7a4bb,0x12c800,0x200000) BlockIO(7ED7F4B8)   Removable MId:1 bsize 200, lblock 1FFFFF (1,073,741,824), partition rw !cached SimpleFileSystem(7ED805F0) 
07: DevicePath(7DD34040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/eMMC(0)/eMMC(0)/HD(3,GPT,397e5c08-d475-429b-8d57-504e9de3eca2,0x32c800,0x1a777df) BlockIO(7ED80688)   Removable MId:1 bsize 200, lblock 1A777DE (14,209,236,480), partition rw !cached 
08: DevicePath(7DD33040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(1) BlockIO(7ED81288)   Removable MId:1 bsize 200, lblock 39B3FFF (30,979,129,344), raw rw !cached 
09: DevicePath(7DD30040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/SD(1)/SD(1)/HD(1,GPT,714a638b-a384-4a61-a45e-40c7691c554a,0x4000,0x3c000) BlockIO(7ED81628)   Removable MId:1 bsize 200, lblock 3BFFF (125,829,120), partition rw !cached SimpleFileSystem(7ED82310) 
0A: DevicePath(7DD2F040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/UsbClass(0x0,0x0,0x9,0x0,0x3)/UsbClass(0x451,0x8140,0x9,0x0,0x3)/UsbClass(0x8564,0x1000,0x0,0x0,0x0) BlockIO(7ED823A8)   Removable MId:1 bsize 200, lblock 1D67FFF (15,787,360,256), raw rw !cached 
0B: DevicePath(7DD2C040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/UsbClass(0x0,0x0,0x9,0x0,0x3)/UsbClass(0x451,0x8140,0x9,0x0,0x3)/UsbClass(0x8564,0x1000,0x0,0x0,0x0)/HD(1,GPT,85b731b6-a4b2-47f4-b1c6-aef6e0f2ce81,0x800,0xfffff) BlockIO(7ED824F8)   Removable MId:1 bsize 200, lblock FFFFE (536,870,400), partition rw !cached SimpleFileSystem(7ED82620) 
0C: DevicePath(7DD2A040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/UsbClass(0x0,0x0,0x9,0x0,0x3)/UsbClass(0x451,0x8140,0x9,0x0,0x3)/UsbClass(0x8564,0x1000,0x0,0x0,0x0)/HD(2,GPT,ac600dc7-3160-4f3c-a824-496d00e3d007,0x100800,0x18fff) BlockIO(7ED826B8)   Removable MId:1 bsize 200, lblock 18FFE (52,428,288), partition rw !cached SimpleFileSystem(7ED82A30) 
0D: DriverBinding(7ED89440) 
   Driver Name [0D]   : <Unknown>
   Driver Image Name  : <Unknown>
   Driver Version     : FFFFFFFF
   Driver Type        : <Unknown>
   Configuration      : NO
   Diagnostics        : NO
   Managing           : None
0E: FirmwareManagement(7FFB8730) 
0F: SimpleNetwork(7ED89628) DevicePath(7DD1F040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/MAC(00e04b6fdccd,1) PXEBaseCode(7ED89940) 
10: ImageDevicePath(7DD13040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/UsbClass(0x0,0x0,0x9,0x0,0x3)/UsbClass(0x451,0x8140,0x9,0x0,0x3)/UsbClass(0x8564,0x1000,0x0,0x0,0x0)/HD(1,GPT,85b731b6-a4b2-47f4-b1c6-aef6e0f2ce81,0x800,0xfffff)/efi\boot\bootaa64.efi LoadedImage(7ED7ABC0)   Revision......: 0x00001000
  ParentHandle..: 7ED7E530
  SystemTable...: 7FF47FF0
  DeviceHandle..: 7ED824D0
  FilePath......: /efi\boot\bootaa64.efi
  PdbFileName...: <null string>
  OptionsSize...: 0
  LoadOptions...: 0
  ImageBase.....: 7DC75000
  ImageSize.....: 9E000
  CodeType......: EfiLoaderCode
  DataType......: EfiLoaderData
  Unload........: 0 
11: ImageDevicePath(7DC72040)   /VenHw(e61d73b9-a384-4acc-aeab-82e828f3628b)/UsbClass(0x0,0x0,0x9,0x0,0x3)/UsbClass(0x451,0x8140,0x9,0x0,0x3)/UsbClass(0x8564,0x1000,0x0,0x0,0x0)/HD(1,GPT,85b731b6-a4b2-47f4-b1c6-aef6e0f2ce81,0x800,0xfffff)/\EFI\BOOT/Shell.efi LoadedImage(7ED8F060)   Revision......: 0x00001000
  ParentHandle..: 7ED7AC30
  SystemTable...: 7FF47FF0
  DeviceHandle..: 7ED824D0
  FilePath......: /\EFI\BOOT/Shell.efi
  PdbFileName...: <null string>
  OptionsSize...: 0
  LoadOptions...: 0
  ImageBase.....: 6E376000
  ImageSize.....: F1000
  CodeType......: EfiLoaderCode
  DataType......: EfiLoaderData
  Unload........: 0 SimpleTextOut(6E2D7048)   Address: 6E2D7048 Attrib 07
     mode 0: Col 80 Row 25
     mode 1: Col -1 Row -1
  *  mode 2: Col 127 Row 39 ShellParameters(6E2B7040) Shell(6E452110) 
Shell> memmap
Type       Start            End              # Pages          Attributes
Available  0000000040000000-0000000047EF3FFF 0000000000007EF4 0000000000000008
ACPI_Recl  0000000047EF4000-0000000047F0BFFF 0000000000000018 0000000000000008
Available  0000000047F0C000-000000006E227FFF 000000000002631C 0000000000000008
BS_Data    000000006E228000-000000006E375FFF 000000000000014E 0000000000000008
LoaderCode 000000006E376000-000000006E557FFF 00000000000001E2 0000000000000008
LoaderData 000000006E558000-000000006E558FFF 0000000000000001 0000000000000008
LoaderCode 000000006E559000-000000007DC6DFFF 000000000000F715 0000000000000008
BS_Data    000000007DC6E000-000000007DC74FFF 0000000000000007 0000000000000008
LoaderCode 000000007DC75000-000000007DD12FFF 000000000000009E 0000000000000008
BS_Data    000000007DD13000-000000007DD1BFFF 0000000000000009 0000000000000008
RT_Data    000000007DD1C000-000000007DD1CFFF 0000000000000001 8000000000000008
BS_Data    000000007DD1D000-000000007DD1FFFF 0000000000000003 0000000000000008
RT_Data    000000007DD20000-000000007DD20FFF 0000000000000001 8000000000000008
BS_Data    000000007DD21000-000000007DD22FFF 0000000000000002 0000000000000008
RT_Data    000000007DD23000-000000007DD24FFF 0000000000000002 8000000000000008
BS_Data    000000007DD25000-000000007DD25FFF 0000000000000001 0000000000000008
RT_Data    000000007DD26000-000000007DD29FFF 0000000000000004 8000000000000008
BS_Data    000000007DD2A000-000000007DD3DFFF 0000000000000014 0000000000000008
LoaderData 000000007DD3E000-000000007FF3FFFF 0000000000002202 0000000000000008
RT_Code    000000007FF40000-000000007FF4FFFF 0000000000000010 8000000000000008
LoaderData 000000007FF50000-000000007FFFFFFF 00000000000000B0 0000000000000008
BS_Data    0000000080000000-000000013FFFFFFF 00000000000C0000 0000000000000008
 
  Reserved  :              0 Pages (0 Bytes)
  LoaderCode:         63,893 Pages (261,705,728 Bytes)
  LoaderData:          8,883 Pages (36,384,768 Bytes)
  BS_Code   :              0 Pages (0 Bytes)
  BS_Data   :        786,808 Pages (3,222,765,568 Bytes)
  RT_Code   :             16 Pages (65,536 Bytes)
  RT_Data   :              8 Pages (32,768 Bytes)
  ACPI_Recl :             24 Pages (98,304 Bytes)
  ACPI_NVS  :              0 Pages (0 Bytes)
  MMIO      :              0 Pages (0 Bytes)
  MMIO_Port :              0 Pages (0 Bytes)
  PalCode   :              0 Pages (0 Bytes)
  Available :        188,944 Pages (773,914,624 Bytes)
  Persistent:              0 Pages (0 Bytes)
              -------------- 
Total Memory:          4,096 MB (4,294,967,296 Bytes)
Shell> smbiosview
SMBIOS Entry Point Structure:
Anchor String:        _SM_
EPS Checksum:         0x37
Entry Point Len:      31
Version:              3.0
Number of Structures: 7
Max Struct size:      73
Table Address:        0x7DD1C020
Table Length:         270
Entry Point revision: 0x0
SMBIOS BCD Revision:  0x0
Inter Anchor:         _DMI_
Inter Checksum:       0x24
Formatted Area:  
  00000000: 00 00 00 00 00                                   *.....*

=========================================================
Query Structure, conditions are:
QueryType   = Random 
QueryHandle = Random
ShowType    = SHOW_DETAIL


=========================================================
Type=0, Handle=0x0
Dump Structure as:
Index=0,Length=0x49,Addr=0x7DD1C020
00000000: 00 18 00 00 01 02 00 00-03 00 80 08 01 00 00 00  *................*
00000010: 00 00 00 0C 15 0A FF FF-55 2D 42 6F 6F 74 00 32  *........U-Boot.2*
00000020: 30 32 31 2E 31 30 2D 72-63 33 2D 30 30 30 30 35  *021.10-rc3-00005*
00000030: 2D 67 37 33 39 64 36 30-36 61 33 30 00 31 30 2F  *-g739d606a30.10/*
00000040: 30 31 2F 32 30 32 31 00-00                       *01/2021..*
Structure Type: BIOS Information
Format part Len : 24
Structure Handle: 0
Vendor: U-Boot
BiosVersion: 2021.10-rc3-00005-g739d606a30
BiosSegment: 0x0
BiosReleaseDate: 10/01/2021
BiosSize:  64 KB
BIOS Characteristics: 
PCI is supported
BIOS is Upgradeable(FLASH)
Selectable Boot is supported
 Bits 32:47 are reserved for BIOS Vendor
 Bits 48:64 are reserved for System Vendor
BIOS Characteristics Extension Byte1:
BIOS Characteristics Extension Byte2:
Enable Targeted Content Distribution
UEFI Specification is supported
 Bits 5:7 are reserved for future assignment
SystemBiosMajorRelease: 21
SystemBiosMinorRelease: 10
EmbeddedControllerFirmwareMajorRelease: 255
EmbeddedControllerFirmwareMinorRelease: 255


=========================================================
Type=1, Handle=0x1
Dump Structure as:
Index=1,Length=0x34,Addr=0x7DD1C069
00000000: 01 1B 01 00 01 02 00 00-00 00 00 00 00 00 00 00  *................*
00000010: 00 00 00 00 00 00 00 00-00 00 00 55 6E 6B 6E 6F  *...........Unkno*
00000020: 77 6E 00 55 6E 6B 6E 6F-77 6E 20 50 72 6F 64 75  *wn.Unknown Produ*
00000030: 63 74 00 00                                      *ct..*
Structure Type: System Information
Format part Len : 27
Structure Handle: 1
Manufacturer: Unknown
ProductName: Unknown Product
Version: 
SerialNumber: 
Dump Uuid
size=16:
00000000: 00 00 00 00 00 00 00 00-00 00 00 00 00 00 00 00  *................*
System Wakeup Type: Reserved
SKUNumber: 
Family: 


=========================================================
Type=2, Handle=0x2
Dump Structure as:
Index=2,Length=0x27,Addr=0x7DD1C09D
00000000: 02 0E 02 00 01 02 00 00-00 01 00 00 00 0A 55 6E  *..............Un*
00000010: 6B 6E 6F 77 6E 00 55 6E-6B 6E 6F 77 6E 20 50 72  *known.Unknown Pr*
00000020: 6F 64 75 63 74 00 00                             *oduct..*
Structure Type: Base Board Information
Format part Len : 14
Structure Handle: 2
Manufacturer: Unknown
ProductName: Unknown Product
Version: 
SerialNumber: 
AssetTag: 
Base Board Feature Flags: Hosting board
LocationInChassis: 
ChassisHandle: 0x0
Base Board Board Type: Motherboard


=========================================================
Type=3, Handle=0x3
Dump Structure as:
Index=3,Length=0x1E,Addr=0x7DD1C0C4
00000000: 03 15 03 00 01 03 00 00-00 03 03 03 03 00 00 00  *................*
00000010: 00 00 00 00 00 55 6E 6B-6E 6F 77 6E 00 00        *.....Unknown..*
Structure Type: System Enclosure
Format part Len : 21
Structure Handle: 3
Manufacturer: Unknown
Type: 3
System Enclosure or Chassis Types:  Desktop
Version: 
SerialNumber: 
AssetTag: 
Bootup state System Enclosure or Chassis Status:  Safe
Power Supply State System Enclosure or Chassis Status:  Safe
Thermal state System Enclosure or Chassis Status:  Safe
Security Status System Enclosure or Chassis Security Status:  None
Dump OemDefined
size=4:
00000000: 00 00 00 00                                      *....*
Height: 0
NumberofPowerCords: 0


=========================================================
Type=4, Handle=0x4
Dump Structure as:
Index=4,Length=0x39,Addr=0x7DD1C0E2
00000000: 04 30 04 00 00 03 02 01-00 00 00 00 00 00 00 00  *.0..............*
00000010: 01 00 00 00 00 00 00 00-01 06 FF FF FF FF FF FF  *................*
00000020: 00 00 00 00 00 00 00 00-02 00 00 00 00 00 00 00  *................*
00000030: 55 6E 6B 6E 6F 77 6E 00-00                       *Unknown..*
Structure Type: Processor Information
Format part Len : 48
Structure Handle: 4
SocketDesignation: 
Processor Type:  Central Processor
Processor Family: Unknown
ProcessorManufacturer: Unknown
Dump ProcessorId
size=8:
00000000: 00 00 00 00 00 00 00 00-                         *........*
ProcessorVersion: Unknown
Processor Information -  Voltage:
ExternalClock: 0
MaxSpeed: 0
CurrentSpeed: 0
Processor Status:
CPU Socket Unpopulated
CPU Enabled
Processor Upgrade: None
L1CacheHandle: 0xFFFF
L2CacheHandle: 0xFFFF
L3CacheHandle: 0xFFFF
SerialNumber: 
AssetTag: 
PartNumber: 
CoreCount: 0
EnabledCoreCount: 0
ThreadCount: 0
Processor Characteristics: No Info
CoreCount2: 0
EnabledCoreCount2: 0
ThreadCount2: 0


=========================================================
Type=32, Handle=0x5
Dump Structure as:
Index=5,Length=0xD,Addr=0x7DD1C11B
00000000: 20 0B 05 00 00 00 00 00-00 00 00 00 00           * ............*
Structure Type: System Boot Information 
Format part Len : 11
Structure Handle: 5
Dump Reserved
size=6:
00000000: 00 00 00 00 00 00                                *......*
System Boot Status:  No errors detected

=========================================================
Type=127, Handle=0x6
Dump Structure as:
Index=6,Length=0x6,Addr=0x7DD1C128
00000000: 7F 04 06 00 00 00                                *......*
Structure Type: End-of-Table 
Format part Len : 4
Structure Handle: 6
This structure indicates the End-of-table!


=========================================================
Shell> acpiview -l
ERROR: Failed to find ACPI Table Guid in System Configuration Table.
Shell> acpiview
ERROR: Failed to find ACPI Table Guid in System Configuration Table.
Shell> acpiview -r 2
ERROR: Failed to find ACPI Table Guid in System Configuration Table.
Shell> acpiview -s DSDT -d 
acpiview: Unable to write to the current directory, check if media is writable.
Shell> acpiview -s SSDT -d
acpiview: Unable to write to the current directory, check if media is writable.
Shell> CapsuleApp.efi -P
'CapsuleApp.efi' is not recognized as an internal or external command, operable program, or script file.
FS2:\> fs3:
FS3:\> dir
Directory of: FS3:\
14/26/2021  20:22 <DIR>             0  EFI
14/26/2021  20:22 <DIR>             0  grub
14/26/2021  20:22                 298  grub.cfg
14/26/2021  20:22          31,783,424  Image
14/26/2021  20:22          94,866,944  ramdisk-busybox.img
          3 File(s)  126,650,666 bytes
          2 Dir(s)
FS3:\> cd EFI
FS3:\EFI\> ls
Directory of: FS3:\EFI\
14/26/2021  20:22 <DIR>             0  .
14/26/2021  20:22 <DIR>             0  ..
14/26/2021  20:22 <DIR>             0  BOOT
          0 File(s)           0 bytes
          3 Dir(s)
FS3:\EFI\> cd BOOT
FS3:\EFI\BOOT\> dir
Directory of: FS3:\EFI\BOOT\
14/26/2021  20:22 <DIR>             0  .
14/26/2021  20:22 <DIR>             0  ..
14/26/2021  20:22 <DIR>             0  app
14/26/2021  20:22 <DIR>             0  bbr
14/26/2021  20:22             647,168  bootaa64.efi
14/26/2021  20:22 <DIR>             0  bsa
14/26/2021  20:22 <DIR>             0  debug
14/26/2021  20:22             987,136  Shell.efi
14/26/2021  20:22               3,779  startup.nsh
          3 File(s)   1,638,083 bytes
          6 Dir(s)
FS3:\EFI\BOOT\> cd app
FS3:\EFI\BOOT\app\> CapsuleApp.efi -P

ASSERT_EFI_ERROR (Status = Not Found)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/MdePkg/Library/DxeServicesTableLib/DxeServicesTableLib.c(58): !EFI_ERROR (Status)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/MdePkg/Library/DxeServicesTableLib/DxeServicesTableLib.c(59): gDS != ((void *) 0)

ASSERT_EFI_ERROR (Status = Not Found)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/Build/MdeModule/DEBUG_GCC5/AARCH64/MdeModulePkg/Application/CapsuleApp/CapsuleApp/DEBUG/AutoGen.c(415): !EFI_ERROR (Status)

ASSERT_EFI_ERROR (Status = Not Found)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/MdePkg/Library/DxeHobLib/HobLib.c(48): !EFI_ERROR (Status)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/MdePkg/Library/DxeHobLib/HobLib.c(49): mHobList != ((void *) 0)
############
# FMP DATA #
############
"dfu_alt_info" env variable not defined!
Probably dfu_alt_info not defined

FS3:\EFI\BOOT\app\> CapsuleApp.efi -E

ASSERT_EFI_ERROR (Status = Not Found)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/MdePkg/Library/DxeServicesTableLib/DxeServicesTableLib.c(58): !EFI_ERROR (Status)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/MdePkg/Library/DxeServicesTableLib/DxeServicesTableLib.c(59): gDS != ((void *) 0)

ASSERT_EFI_ERROR (Status = Not Found)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/Build/MdeModule/DEBUG_GCC5/AARCH64/MdeModulePkg/Application/CapsuleApp/CapsuleApp/DEBUG/AutoGen.c(415): !EFI_ERROR (Status)

ASSERT_EFI_ERROR (Status = Not Found)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/MdePkg/Library/DxeHobLib/HobLib.c(48): !EFI_ERROR (Status)
ASSERT [CapsuleApp] /home/cherat01/ATEG/OOB/arm-systemready/IR/scripts/edk2/MdePkg/Library/DxeHobLib/HobLib.c(49): mHobList != ((void *) 0)
##############
# ESRT TABLE #
##############
EFI_SYSTEM_RESOURCE_TABLE:
FwResourceCount    - 0x0
FwResourceCountMax - 0x0
FwResourceVersion  - 0x1

FS3:\EFI\BOOT\app\> 

